tap "arkweid/lefthook"
tap "attheodo/formulae"
tap "dteoh/sqa"
tap "evilmartians/lefthook"
tap "federico-terzi/espanso"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "romkatv/powerlevel10k"
tap "teamookla/speedtest"
tap "wpscanteam/tap"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# General-purpose data compression with high compression ratio
brew "xz"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Core application library for C
brew "glib"
# Shell extension to jump to frequently used directories
brew "autojump"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way to see and navigate directory trees
brew "broot"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Malware identification and classification tool
brew "yara"
# Anti-virus software
brew "clamav"
# Statistics utility to count lines of code
brew "cloc"
# Configurable talking characters in ASCII art
brew "cowsay"
# Reimplementation of ctags(1)
brew "ctags"
# Top-like interface for container metrics
brew "ctop"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Programming language for highly scalable real-time systems
brew "erlang"
# Text to speech, software speech synthesizer
brew "espeak"
# Official Go implementation of the Ethereum protocol
brew "ethereum"
# Modern replacement for 'ls'
brew "exa"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Work on GitHub issues on the command-line
brew "ghi"
# International domain name library
brew "libidn"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Asynchronous event library
brew "libevent"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image manipulation
brew "netpbm"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# GUI toolkit
brew "gtk+"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Command-line oriented TCP/IP packet assembler/analyzer
brew "hping"
# Improved top (interactive process viewer)
brew "htop"
# Website copier/offline browser
brew "httrack"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Multi-format archive and compression library
brew "libarchive"
# GNOME XML library
brew "libxml2"
# C XSLT library for GNOME
brew "libxslt"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Create Mac OS VPNs programmatically
brew "macosvpn"
# Mac App Store command-line interface
brew "mas"
# Terminal-based visual file manager
brew "midnight-commander"
# Manage and monitor processes, files, directories, and devices
brew "monit"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql@5.7", restart_service: true
# NCurses Disk Usage
brew "ncdu"
# Tool Command Language
brew "tcl-tk"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql@11", restart_service: true
# Object-relational database system
brew "postgresql@14"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Fuzzy Finder in rust!
brew "sk"
# SMART hard drive monitoring
brew "smartmontools"
# Cross-shell prompt for astronauts
brew "starship"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Load testing for HTTP, PostgreSQL, Jabber, and others
brew "tsung"
# Extraction utility for .zip compressed archives
brew "unzip"
# Google's open source JavaScript engine
brew "v8@3.15"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fast and powerful Git hooks manager for any type of projects
brew "evilmartians/lefthook/lefthook"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Black box WordPress vulnerability scanner
brew "wpscanteam/tap/wpscan"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# All-in-one toolbox for developers
cask "devutils"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
cask "google-backup-and-sync"
# Animated screen capture application
cask "licecap"
# Open-source Markdown editor
cask "macdown"
# Open-source, KeePass-client and password manager
cask "macpass"
# Visual diff and merge tool
cask "meld"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
cask "slowquitapps"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Virtualizer for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
cask "webpquicklook"
# Open-source markdown editor
cask "zettlr"
mas "1Password", id: 443987910
mas "AdBlock Pro", id: 1018301773
mas "Agenda", id: 1287445660
mas "Amphetamine", id: 937984704
mas "Anybuffer", id: 1330815414
mas "AnyVideo Converter HD", id: 438670247
mas "Battery Monitor", id: 836505650
mas "bmGlyph", id: 490499048
mas "Bookmarks", id: 1503569422
mas "Boop", id: 1518425043
mas "Cambridge Dictionaries", id: 844870200
mas "ChmPages", id: 1164062917
mas "CloudApp", id: 417602904
mas "Compare Folders", id: 816042486
mas "Core Tunnel", id: 1354318707
mas "Countdown Timer Plus", id: 1150771803
mas "Disk Speed Test", id: 425264550
mas "Display Menu", id: 549083868
mas "Evernote", id: 406056744
mas "Evernote Web Clipper", id: 1481669779
mas "Focus To-Do", id: 1258530160
mas "Focused Work", id: 1523968394
mas "Ghostery Lite", id: 1436953057
mas "Grammarly for Safari", id: 1462114288
mas "iCompta", id: 402590139
mas "Infuse", id: 1136220934
mas "Keepa - Price Tracker", id: 1533805339
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LimeChat", id: 414030210
mas "MindNode Pro", id: 402398561
mas "Moom", id: 419330170
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "Pixelmator", id: 407963104
mas "Pocket", id: 568494494
mas "pomodorome", id: 1484801884
mas "Relax Melodies", id: 467103113
mas "Smart JSON Editor", id: 1268962404
mas "SnippetsLab", id: 1006087419
mas "Star Trails", id: 554953233
mas "Stockfish", id: 801463932
mas "Telegram", id: 747648890
mas "TextExpander", id: 405274824
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Time Out", id: 402592703
mas "Tomito", id: 1526042938
mas "Vimari", id: 1480933944
mas "WorkingHours", id: 1495643653
mas "Xcode", id: 497799835
mas "Yep", id: 406504852
